# 피봇테이블과 그룹분석

### 피봇테이블

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [3]:
df1.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [4]:
df1.set_index(["도시", "연도"])[["인구"]].unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [6]:
pd.__version__ # 버젼이 맞지 않아서 실행이 안되는 경우가 있다.
# 이런 경우 버젼업이나 버젼 다운을 하지말고 가상환경을 만들어야 한다. 매우 중요!

'1.0.5'

### 그룹분석

In [7]:
np.random.seed(2020)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [8]:
groups = df2.groupby(df2.key1)
groups

In [9]:
groups.groups

{'A': Int64Index([0, 1, 4], dtype='int64'),
 'B': Int64Index([2, 3], dtype='int64')}

In [12]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [13]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [14]:
df2.groupby(df2.key1).mean()

         data1      data2
key1
A     2.666667  26.666667
B     3.500000  35.000000

In [16]:
df2.groupby(df2['key1']).mean()

         data1      data2
key1
A     2.666667  26.666667
B     3.500000  35.000000

In [20]:
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [21]:
df2.groupby(df2.key1)[('data1', 'data2')].sum()

      data1  data2
key1
A         8     80
B         7     70

In [23]:
df2.groupby(df2.key1)[('data1',)].sum()
# 튜플에 자료가 하나일 경우 ,(콤마)를 꼭 마지막에 붙여줘야 한다.

      data1
key1
A         8
B         7

In [24]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [25]:
df2.groupby([df2["key1"], df2["key2"]])['data1'].sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [26]:
df2.groupby([df2["key1"], df2["key2"]]).sum()['data1']

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [27]:
import seaborn as sns
iris = sns.load_dataset("iris")

In [28]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

iris.groupby(iris.species).agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [29]:
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [33]:
iris.groupby(iris.species)['sepal_length'].describe()

            count   mean       std  min    25%  50%  75%  max
species
setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

In [34]:
def top3_petal_length(df):
    return df.sort_values(by="petal_length", ascending=False)[:3]

iris.groupby(iris.species).apply(top3_petal_length)

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     24            4.8          3.4           1.9          0.2
           44            5.1          3.8           1.9          0.4
           23            5.1          3.3           1.7          0.5
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           72            6.3          2.5           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     24       setosa
           44       setosa
           23       setosa
versicolor 83   versicolor
           77   versicolor
           72   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

In [35]:
def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)


iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)
iris[["petal_length", "petal_length_class"]].tail(10)

     petal_length petal_length_class
140           5.6                  중
141           5.1                  소
142           5.1                  소
143           5.9                  대
144           5.7                  중
145           5.2                  소
146           5.0                  소
147           5.2                  소
148           5.4                  중
149           5.1                  소

붓꽃(iris) 데이터에서 붓꽃 종(species)별로 꽃잎길이(sepal_length), 꽃잎폭(sepal_width) 등의 평균을 구하라. 만약 붓꽃 종(species)이 표시되지 않았을 때 이 수치들을 이용하여 붓꽃 종을 찾아낼 수 있을지 생각하라.

In [37]:
iris.groupby(iris.species)[('sepal_length', 'sepal_width')].mean()

            sepal_length  sepal_width
species
setosa             5.006        3.428
versicolor         5.936        2.770
virginica          6.588        2.974

### 피봇테이블

In [38]:
df1.pivot_table("인구", "도시", "연도")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [40]:
df1.pivot_table("인구", "도시", "연도", margins=True, margins_name="평균")

연도       2005       2010       2015            평균
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
평균  6637546.5  4429292.0  5414500.0  5.350809e+06

In [41]:
df1["인구"].mean()

5350808.625

In [42]:
df1.인구.mean() # 빈 공간이 없으면 한글도 인식 가능(utf-8덕분에)

5350808.625

In [46]:
df1.pivot_table("인구", index=["연도", "도시"])

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

In [45]:
df1.pivot_table("인구", index=["연도", "도시"], columns="연도")

연도            2005       2010       2015
연도   도시
2005 부산  3512547.0        NaN        NaN
     서울  9762546.0        NaN        NaN
2010 부산        NaN  3393191.0        NaN
     서울        NaN  9631482.0        NaN
     인천        NaN   263203.0        NaN
2015 부산        NaN        NaN  3448737.0
     서울        NaN        NaN  9904312.0
     인천        NaN        NaN  2890451.0

### tip dataset으로 분석

In [49]:
import seaborn as sns
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [50]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.tail()

     total_bill   tip     sex smoker   day    time  size   tip_pct
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

In [51]:
tips.describe() # 범주형 자료는 결과로 출력 불가능하다.

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [52]:
tips.groupby("sex").count() # 데이터의 갯수를 의미(NaN이 없다면 다 같은 값이 출력될 것)

        total_bill  tip  smoker  day  time  size  tip_pct
sex
Male           157  157     157  157   157   157      157
Female          87   87      87   87    87    87       87

In [53]:
# 성별 데이터 숫자
tips.groupby(["sex", "smoker"]).size()

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [54]:
# 성별과 흡연유무 피봇 테이블
tips.pivot_table("tip_pct", "sex", "smoker", aggfunc="count", margins=True)

smoker  Yes   No  All
sex
Male     60   97  157
Female   33   54   87
All      93  151  244

In [56]:
# 성별에 따른 팁 비율
tips.groupby("sex")[["tip_pct"]].mean()

         tip_pct
sex
Male    0.157651
Female  0.166491

In [57]:
tips.groupby("smoker")[["tip_pct"]].mean()

         tip_pct
smoker
Yes     0.163196
No      0.159328

In [58]:
tips.pivot_table("tip_pct", ["sex", "smoker"])

                tip_pct
sex    smoker
Male   Yes     0.152771
       No      0.160669
Female Yes     0.182150
       No      0.156921

In [59]:
tips.pivot_table("tip_pct", "sex", "smoker")

smoker       Yes        No
sex
Male    0.152771  0.160669
Female  0.182150  0.156921

팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

In [62]:
tips.pivot_table("tip_pct", "day", "size")

size         1         2         3         4         5         6
day
Thur  0.181728  0.163935  0.144599  0.145515  0.121389  0.173706
Fri   0.223776  0.168693  0.187735  0.117750       NaN       NaN
Sat   0.231832  0.155289  0.151439  0.138289  0.106572       NaN
Sun        NaN  0.180870  0.152662  0.153168  0.159839  0.103799

In [64]:
tips.pivot_table("tip_pct", "time", "size")

size           1         2         3         4         5         6
time
Lunch   0.202752  0.165750  0.153226  0.145515  0.121389  0.173706
Dinner  0.231832  0.165704  0.151995  0.146017  0.146522  0.103799

In [65]:
tips.pivot_table("tip_pct", "time", "day")

day         Thur       Fri       Sat       Sun
time
Lunch   0.161301  0.188765       NaN       NaN
Dinner  0.159744  0.158916  0.153152  0.166897

In [69]:
x = tips.pivot_table("tip_pct", ["time", "day", "size"])
x

                   tip_pct
time   day  size
Lunch  Thur 1     0.181728
            2     0.164024
            3     0.144599
            4     0.145515
            5     0.121389
            6     0.173706
       Fri  1     0.223776
            2     0.181969
            3     0.187735
Dinner Thur 2     0.159744
       Fri  2     0.162659
            4     0.117750
       Sat  1     0.231832
            2     0.155289
            3     0.151439
            4     0.138289
            5     0.106572
       Sun  2     0.180870
            3     0.152662
            4     0.153168
            5     0.159839
            6     0.103799

In [77]:
tips.groupby("day")[["tip_pct"]].mean()

       tip_pct
day
Thur  0.161276
Fri   0.169913
Sat   0.153152
Sun   0.166897

In [78]:
tips.groupby("time")[["tip_pct"]].mean()

         tip_pct
time
Lunch   0.164128
Dinner  0.159518

In [79]:
tips.groupby("size")[["tip_pct"]].mean()

       tip_pct
size
1     0.217292
2     0.165719
3     0.152157
4     0.145949
5     0.141495
6     0.156229

In [80]:
# 위의 과정을 가장 깔끔하게 보는 방법

tips.pivot_table("tip_pct", index=["time", "day"], columns="size", margins=True, margins_name='평균')

size                1         2         3         4         5         6  \
time   day
Lunch  Thur  0.181728  0.164024  0.144599  0.145515  0.121389  0.173706
       Fri   0.223776  0.181969  0.187735       NaN       NaN       NaN
Dinner Thur       NaN  0.159744       NaN       NaN       NaN       NaN
       Fri        NaN  0.162659       NaN  0.117750       NaN       NaN
       Sat   0.231832  0.155289  0.151439  0.138289  0.106572       NaN
       Sun        NaN  0.180870  0.152662  0.153168  0.159839  0.103799
평균           0.217292  0.165719  0.152157  0.145949  0.141495  0.156229

size               평균
time   day
Lunch  Thur  0.161301
       Fri   0.188765
Dinner Thur  0.159744
       Fri   0.158916
       Sat   0.153152
       Sun   0.166897
평균           0.160803

In [82]:
def peak_to_peak(x):
    return x.max() - x.min()
    
tips.groupby(["sex", "smoker"])[["tip"]].agg(peak_to_peak)

                tip_pct
sex    smoker
Male   Yes     0.674707
       No      0.220186
Female Yes     0.360233
       No      0.195876

In [83]:
tips.groupby(["sex", "smoker"])[["tip_pct"]].agg(peak_to_peak)

                tip_pct
sex    smoker
Male   Yes     0.674707
       No      0.220186
Female Yes     0.360233
       No      0.195876

In [85]:
tips.groupby(["sex", "smoker"])[["tip_pct"]].agg(["mean", peak_to_peak])

                tip_pct
                   mean peak_to_peak
sex    smoker
Male   Yes     0.152771     0.674707
       No      0.160669     0.220186
Female Yes     0.182150     0.360233
       No      0.156921     0.195876

In [86]:
tips.groupby(["sex", "smoker"]).agg(
    {'tip_pct': 'mean', 'total_bill': peak_to_peak})
# tip_pct에는 평균값을, total_bill에는 최대, 최소 차이값을 한번에 출력

                tip_pct  total_bill
sex    smoker
Male   Yes     0.152771       43.56
       No      0.160669       40.82
Female Yes     0.182150       41.23
       No      0.156921       28.58

In [87]:
tips.pivot_table('size', ['time', 'sex', 'smoker'], 'day',
                 aggfunc='sum', fill_value=0)

day                   Thur  Fri  Sat  Sun
time   sex    smoker
Lunch  Male   Yes       23    5    0    0
              No        50    0    0    0
       Female Yes       17    6    0    0
              No        60    3    0    0
Dinner Male   Yes        0   12   71   39
              No         0    4   85  124
       Female Yes        0    8   33   10
              No         2    2   30   43

### DatetimeIndex 인덱스